Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: It allows the teacher to tell the story in a free, engaging manner, maintaining eye contact with the children’, Carlsen adds.
nb: Da kan læreren fortelle det på en fri og engasjerende måte, og samtidig ha øyekontakt med barna, mener Carlsen.

source: The distribution between boys and girls who choose mathematics specialisation in upper secondary school should also be noted.
nb: Det er her verdt å merke seg fordelingen mellom jenter og gutter som velger full fordypning i matematikk i videregående skole.

source: describe sample space and represent probability as fraction, percentage and decimal number
nb: beskrive utfallsrom og uttrykke sannsynlighet som brøk, prosent og desimaltall

source: Data were collected from responses to a questionnaire sent to the preschool teachers, head preschool teachers and parents of a total of 2021 children in the municipality of Karlstad in Sweden.
nb: Dataene er samlet inn gjennom en spørreundersøkelse som er besvart av barnehagelærere, barnehagestyrere og foreldrene til i alt 2021 barn i Karlstad kommune i Sverige.

source: At Täppan, the visiting parents get put to work.
nb: På Täppan blir de satt i arbeid.

source: This means recognising concrete problems that can be solved using numeracy skills and formulating questions about these.
nb: Det innebærer å kjenne igjen konkrete problemer som kan løses ved regning, og formulere spørsmål om disse.

source: To explain something means to give a well-grounded explanation of a subject, an issue or something we wish to examine or implement.
nb: Å beskrive er å skildre eller gjengi en opplevelse, situasjon, arbeidsprosess eller et faglig emne muntlig, skriftlig eller digitalt.

source: This also has linguistic aspects, such as reasoning, communicating converse about and applying reason to ideas.
nb: Dette har også språklige aspekter, som det å formidle, samtale om og resonnere omkring ideer.

source: Websites and multimedia
nb: Nettsteder og multimedier

source: The Swedish authorities decided as early as in 2009 that so-called entrepreneurial learning should permeate the entire educational system, from kindergartens to higher education.
nb: Svenske myndigheter bestemte allerede i 2009 at såkalt entreprenøriell læring skulle gjennomsyre hele utdanningssystemet, fra barnehagene til høyere utdanning.

source: use language appropriate to the situation in social, professional and intercultural contexts
nb: bruke situasjonstilpasset språk i sosiale, faglige og interkulturelle sammenhenger

source: The assistants spend more than 80 per cent of their time with the children.
nb: Assistentene bruker i overkant av 80 prosent av tiden sammen med barna.

source: use hand tools and joining techniques for wood, clay and textiles in a
nb: bruke håndverktøy og sammenføyningsteknikker i tre, leire og tekstil på

source: Overview of main subject areas:
nb: Oversikt over hovedområder:

source: in Basic Norwegian for language minorities involves listening to and understanding the content of oral language and being able to make oneself understood.
nb: i grunnleggende norsk for språklige minoriteter innebærer å lytte til og forstå innholdet i forskjellige muntlige ytringer og selv kunne gjøre seg forstått.

source: describe strategies in multiplication
nb: utforske og beskrive strategier i multiplikasjon

source: tell others about the Sami people, Norway's indigenous population, and about key characteristics of the culture and living conditions for the Sami people up to the Viking period
nb: fortelle om hovedtrekk ved jernalder i Sápmi/Sábme/Saepmie og samtale om bronsealder og jernalder i Norge og Norden for øvrig

source: reflect on equalities and inequalities in cultural expression, identity and
nb: dokumentere øving individuelt og i samspill og bruke dokumentasjonen

source: They also demonstrate and develop competence when they apply and reflect on natural-science practices and approaches and natural-science technology.
nb: Videre viser og utvikler de kompetanse når de anvender og reflekterer over naturvitenskapelige praksiser og tenkemåter og naturvitenskapelig teknologi.

source: Exercise and lifestyle
nb: Trening og livsstil

source: Even when other children are present, children can get a feeling of being alone when they use technology in kindergarten.
nb: Selv om andre barn er til stede, kan barn ha en opplevelse av å være alene når de bruker teknologi i barnehagen.

source: make use of digital media to write and respond appropriately to messages
nb: bruke digitale medier til å skrive og gi hensiktsmessig respons på meldinger

source: give an account of the most important events in Christian history from the Reformation to modern Norway and for the world in general, and for Christianity's position in the world today
nb: gjøre rede for viktige hendelser i kristendommens historie fra reformasjonen til vår tid i Norge og i verden og for kristendommens stilling i dag

source: Fieldwork ensures a good basis for knowledge on and attitudes in this area.
nb: Feltarbeid legger et godt grunnlag for kunnskap om og holdninger på dette området.

source: explain, illustrate and evaluate the composition, valency and properties of matter using the periodic table
nb: forklare, illustrere og vurdere stoffers sammensetning, bindingstyper og egenskaper ved hjelp av periodesystemet

source: Mathematics shows its usefulness as a practical tool.
nb: I praktisk bruk viser matematikk sin nytte som redskapsfag.

source: collect, sort, note and illustrate data using tally marks, tables and bar graphs, converse about the process and what the illustrations tell us about the data
nb: samle, sortere, notere og illustrere data med tellestreker, tabeller og søylediagrammer, og samtale om prosessen og hva illustrasjonene forteller om datamaterialet

source: Girls’ and boys’ learning in the doll corner or in the pillow room at kindergarten is important for their understanding of who they are – and what they can become.
nb: Jenters og gutters læring i dukkekroken eller på puterommet i barnehagen får betydning for barnas forståelse av hvem de er – og hva de kan bli.

source: The main subject area also is concerned with how weather reports are prepared.
nb: Programfaget handler videre om fysisk og psykisk omsorg for pasienter og pårørende.

source: carry out experiments with light, vision and colour, describe and explain the results
nb: gjennomføre forsøk med lys, syn og farger, beskrive og forklare resultatene

source: Curriculum for the elective subject of Volunteer effort (IFA1-01)
nb: Læreplan i valgfaget innsats for andre (IFA1-01)

source: Curriculum for mother tongue teaching for language minorities (NOR8-01)
nb: Læreplan i morsmål for språklige minoriteter (NOR8-01)

source: The comprehensive school for all shall be based on and address the diversity of the pupils’1 backgrounds and aptitudes.
nb: Fel esskolen skal bygge på og ivareta mangfoldet i elevenes1 bakgrunn og forutsetninger.

source: It is puzzling that Slovenia and Italy – the two countries with the best results taking into consideration that they tested at least 40% and 20% of the age cohort in TIMSS Advanced – are the two countries which appear to be most reserved regarding calculator use.
nb: Det er et tankekors at Slovenia og Italia, de to referanselandene med best resultat tatt i betraktning at de tester henholdsvis vel 40 % og 20 % av årskullet i TIMSS Advanced, er de to landene som synes å være mest tilbakeholdne med bruk av kalkulator.

source: Operation and production 197 teaching hours per year
nb: Drift og produksjon 197 årstimer

source: give an account of the structure, nomenclature, production, properties and use of aliphatic hydrocarbons, alkyl halides, alcohols, aldehydes, ketones, carboxyl acids, esters, ethers and amines
nb: gjøre rede for struktur, navnsetting, framstilling, egenskaper og bruk av alifatiske hydrokarboner, alkylhalider, alkoholer, aldehyder, ketoner, karboksylsyrer, estere, etere og aminer

source: in Mathematics involves describing and explaining a process of thought and putting words to discoveries and ideas.
nb: i matematikk innebærer å beskrive og forklare en tankegang og sette ord på oppdagelser og ideer.

source: Curriculum for the elective subject of International Cooperation (ISA1-01)
nb: Læreplan i valgfaget internasjonalt samarbeid (ISA1-01)

source: Based on the demonstrated competence of the pupils, they shall be given the opportunity toexpress what they believe they can accomplish and reflect on their own academic development in relation to processes and products.
nb: Læreren skal planlegge og legge til rette for at elevene får vist kompetansen sin på varierte måter som inkluderer forståelse, refleksjon og kritisk tenkning, i ulike sammenhenger.

source: Using digital tools means gathering relevant information from websites, being critical to source information, sorting and analyzing data.
nb: Å bruke digitale verktøy betyr å innhente relevant informasjon fra nettsteder, utøve kildekritikk, sortere og analysere et materiale og beherske digital kildehenvisning.

source: analyze, elaborate on and discuss how communication is influenced by social factors
nb: analysere og drøfte hvordan kommunikasjon påvirkes av sosiale faktorer

source: The main subject area Social problems is concerned with the causes and effects of social problems.
nb: handler om velferdsstatens prinsipper, lover og politiske styring, og velferdsstatens utfordringer i nåtid og framtid.

source: Listening and speaking, Reading and writing
nb: Lytte og tale, Lese og skrive

source: All kindergartens have a calendar.
nb: Alle barnehager har en kalender.

source: Being able to express oneself orally and in writing
nb: Det omfatter mer enn å høre, oppfatte lyd og å tale.

source: It also deals with open experimentation and instrumental analyses.
nb: Videre dreier det seg om åpne forsøk og instrumentelle analyser.

source: summarize and describe the content of films, plays, radio and TV programmes, and describe their own reactions to these
nb: oppsummere og beskrive innholdet i filmer, teaterstykker, radio- og tv-programmer og beskrive egne reaksjoner på disse

source: talk about and explain what religion is, and show how religion is expressed in different ways
nb: samtale om og forklare hva religion er, og vise hvordan religion kommer til uttrykk på ulike måter

source: Geography and history are continued as common core subjects in the programmes for general studies.
nb: Geografi og historie blir ført videre som fellesfag i de studieforberedende utdanningsprogrammene.

source: Reading training should encourage the pupils to read and requires them to read different types of texts, both in order to learn and for the experience itself.
nb: Hovedområdet omfatter arbeid med begreper og ordforråd, sammen med kunnskaper og ferdigheter i å anvende ordforråd, språklige uttrykk, rettskriving, grammatikk og oppbygging av setninger og tekster.

source: It is important to
nb: Det er viktig

source: use basic grammatical and text structures of English orally and in writing
nb: bruke språkets grunnleggende formverk og tekststrukturer muntlig og skriftlig

source: The teacher and pupils shall engage in dialogue about their development in natural science.
nb: Læreren og elevene skal være i dialog om elevenes utvikling i naturfag.

source: Williams finds that the tradition of social pedagogy stands strong in preschools.
nb: Williams finner at den sosialpedagogiske tradisjonen står sterkt i barnehagene.

source: explain what happens during puberty and talk about gender identities and variation in sexual orientation
nb: forklare det som skjer under puberteten, og samtale om ulik kjønnsidentitet og variasjon i seksuell orientering

source: It also means it is important to find information, analyse, process and present data using appropriate tools, and being critical of sources, analyses and results.
nb: Videre vil det si å finne informasjon, analysere, behandle og presentere data med hensiktsmessige verktøy, og være kritisk til kilder, analyser og resultater.

source: use digital aids and natural science equipment for experimental work and fieldwork
nb: bruke digitale hjelpemidler og naturfaglig utstyr ved eksperimentelt arbeid og feltarbeid

source: They also demonstrate and develop competence when exploring in practical contexts and switching between representations in problem solution and modelling.
nb: Elevene viser og utvikler også kompetanse når de utforsker i praktiske sammenhenger og oversetter mellom representasjonsformer i problemløsing og modellering.

source: Competence aims after 1P – Vg1 education programmes for general studies
nb: Kompetansemål etter 1P – Vg1 studieforberedende utdanningsprogram

source: The teacher facilitates pupil participation and encourages the desire to learn through a variety of practical assignments in workshops and by the pupils highlighting current issues through creative processes.
nb: Læreren skal legge til rette for elevmedvirkning og stimulere til lærelyst gjennom varierte praktiske oppgaver i verkstedene og ved at elevene får belyse utfordringer i samtiden gjennom skapende prosesser.

source: They feel uncertain, and they find this stressful.
nb: De er usikre, og de opplever dette som stressende.

source: How many participants have been involved in the programme at a local level?
nb: Lærerne mente at elevrådet ved skolen fungerte bra, og har gjort det i alle år.

source: This also has linguistic aspects, such as reasoning and communicating ideas.
nb: Dette har også språklige aspekter, som det å formidle, samtale om og resonnere omkring ideer.

source: In this way, the programme subject can help focus on the environment and sustainable development.
nb: På den måten kan programfaget bidra til å fokusere på miljø og bærekraftig utvikling.

source: In the sports preschool, the girls are more daring.
nb: I idrettsbarnehagen tør jentene mer.

source: Sociology and social anthropology
nb: Sosiologi og sosialantropologi

source: The obligation of confidentiality and privacy requirements must be observed.
nb: Det må legges til rette for håndhygiene når munnbindet skal tas på og av.

source: Being able to express oneself in writing and orally
nb: Å kunne uttrykke seg skriftlig og muntlig

source: To use, which is closely related to apply, is understood as to utilise or to employ, for example, a method or a tool.
nb: Å bruke henger nært sammen med å anvende, forstått som å gjøre bruk av, ta i bruk, for eksempel en metode eller et verktøy.

source: In the Communication and culture programme subject, basic skills are understood as follows:
nb: I programfaget kommunikasjon og kultur forstås grunnleggende ferdigheter slik:

source: This situation makes Sandra think that her participation is not important.
nb: I situasjonen her lærer Sandra at hennes bidrag ikke er viktig.

source: discuss and elaborate on selected texts from Islamic written traditions
nb: drøfte utvalgte tekster fra islamsk skrifttradisjon

source: ‘The pedagogical leader must be recognised as a hybrid.
nb: – Den pedagogiske lederen må anerkjennes som en hybrid leder.

source: The curriculum for Basic Norwegian for language minorities may be used in primary and lower secondary school and in upper secondary education and training.
nb: Læreplanen i grunnleggende norsk for språklige minoriteter kan brukes både i grunnskolen og innen videregående opplæring.

source: describe locating and moving around a grid, on a map and within a coordinate system, with and without the use of digital tools, and use coordinates to calculate parallel distances with axes in a coordinate system
nb: beskrive plassering og flytting i rutenett, på kart og i koordinatsystem, med og uten digitale hjelpemidler, og bruke koordinater til å beregne avstander parallelt med aksene i et koordinatsystem

source: The subject shall promote the ability to reason and solve problems in society through discussion and by stimulating the desire and ability to seek knowledge about society and cultures.
nb: Faget skal fremme evnen til å diskutere, resonnere og løse problemer i samfunnet ved å påvirke lysten og evnen til å søke kunnskap om samfunn og kultur.

source: elaborate on the use of some sources of energy in earlier times and in contemporary times, and describe consequences for the environment, locally and globally
nb: gjøre greie for bruk av noen energikilder før og nå og beskrive konsekvenser for miljøet lokalt og globalt

source: talk about linguistic images in their mother tongue
nb: samtale om språklige bilder i morsmålet

source: solve linear optimization problems graphically, using longhand and digital means
nb: løse lineære optimeringsproblemer grafisk, ved regning og med digitale hjelpemidler

source: Being able to recognise and use geometric patterns in aesthetic expression and architecture presupposes simple proficiency in calculating.
nb: Å kunne gjenkjenne og bruke geometriske mønstre i estetiske uttrykk og arkitektur forutsetter regneferdigheter.

source: different platforms for digital interaction and
nb: ulike plattformer for digital samhandling og

source: For some children it will always be difficult to enter this community.
nb: For noen barn er det vanskelig å komme inn i dette fellesskapet uansett.

source: In this main subject area, mathematics is used to systematize observations through the laws of physics.
nb: Videre er utvikling av forståelse for sammenhenger mellom en teksts form og funksjon sentralt i hovedområdet.

source: This main subject area also discusses personnel issues and managerial work within an organization.
nb: Hovedområdet dreier seg videre om personal- og ledelsesarbeid i en organisasjon.

source: But while only one child plays, others are attracted to it, so they stand around and watch.
nb: Men når ett barn spiller, tiltrekker det seg andre som stiller seg rundt og ser på.

source: talk about ethics related to different family constellations, the relationship between the sexes, gender identity roles and the relationship between the generations
nb: samtale om etikk i forbindelse med ulike familieformer, forholdet mellom kjønnene, ulik kjønnsidentitet og forholdet mellom generasjonene

source: This is a completely different picture to that of mathematics teachers in primary and lower secondary school.
nb: Dette er et totalt annet bilde enn det man har fått av lærere som underviser i matematikk i grunnskolen.

source: elaborate on breeding targets for actual fish-farm organisms
nb: gjøre rede for avlsmål for aktuelle oppdrettsorganismer

source: Teaching hours are given in 60-minute units.
nb: Timetall er oppgitt i 60 minutters enheter

source: explain how production and consumption can destroy ecosystems and pollute soil, water and air, and discuss and elaborate on how this might be prevented and repaired
nb: beskrive hvordan produksjon og forbruk kan ødelegge økosystemer og forurense jord, vann og luft, og drøfte hvordan dette kan hindres og repareres

source: describe characteristics of vertebrates and explain the functions of the most important organs
nb: beskrive kjennetegn ved virveldyr og forklare funksjonen til de viktigste organene

source: disaster and its consequences for people, society and nature
nb: miljøkatastrofe og konsekvenser for mennesker, samfunn og natur

source: compare narrative techniques and values in a selection of contemporary texts with narrative techniques and values in legends and folklore
nb: sammenligne fortellemåter og verdier i et utvalg samtidstekster med fortellemåter og verdier i myter og folkediktning

source: It deals with political parties and the things that can threaten a democracy.
nb: Det handler om de politiske partiene og hva som kan true demokratiet.

source: The teacher and pupils shall engage in dialogue about their development in the History subject.
nb: Læreren og elevene skal være i dialog om elevenes utvikling i historie.

source: The pupils should receive one coursework grade.
nb: Eleven skal ha to standpunktkarakterer, én i tekstskaping og én i muntlig samhandling.

source: The main subject area also covers describing locations and moving around grids, maps and coordinate systems.
nb: Hovedområdet omfatter også å beskrive plassering og forflytning i rutenett, kart og koordinatsystemer.

source: In addition, she filmed the interaction between these teachers and 64 children, then asked the teachers: What is happening here?
nb: I tillegg har hun filmet samhandlingen mellom dem og 64 barn og spurt barnehagelærerne: Hva skjer her?

source: Practical and theoretical work in laboratories and in the field using different theses and research questions is necessary to gain experience with and develop knowledge of the methods and approaches in natural science.
nb: Å arbeide både praktisk og teoretisk i laboratorier og naturen med ulike problemstillinger er nødvendig for å få erfaring med og utvikle kunnskap om naturvitenskapens metoder og tenkemåter.

source: It involves hygiene, health, environment and safety, equipment selection, economics and the farmed organisms’ optimal weight and welfare.
nb: Det dreier seg om hygiene, helse, miljø og sikkerhet, utstyrsvalg, økonomi og oppdrettsorganismenes optimale vekst og trivsel.

source: Hanne Værum Sørensen, another researcher, studied three of the 43 preschools in greater depth.
nb: Forskerkollega Hanne Værum Sørensen har studert tre av disse 43 barnehagene nærmere.

source: Writing in mathematics is a tool for developing one’s own thoughts and learning.
nb: Å kunne skrive i matematikk er et redskap for å utvikle egne tanker og egen læring.

source: History and philosophy 2 builds on History and philosophy 1.
nb: Historie og filosofi 2 bygger på historie og filosofi 1.

source: write simple technical texts, composite texts, stories and letters
nb: skrive enkle fagtekster, sammensatte tekster, fortellinger og brev

source: Geosciences X Geosciences 1 and Geosciences 2 are built up so that one can choose either subject, independent of the other.
nb: Geofag 1 og geofag 2 er bygd opp slik at de kan velges uavhengig av hverandre.

source: use the United Nations’ Convention on the Rights of Children to understand children's rights and equality, and be able to find examples of this in the media and on Internet
nb: bruke FNs barnekonvensjon for å forstå barns rettigheter og likeverd og kunne finne eksempler i mediene og ved bruk av Internett

source: The programme subject covers use of working drawings, schedules, procedures, standards and digital tools as a basis for trouble-shooting, repair and maintenance.
nb: Programfaget omfatter bruk av arbeidstegninger, skjemaer, prosedyrer, standarder og digitale verktøy som grunnlag for feilsøking, reparasjon og vedlikehold.

source: This main area also focuses on developing knowledge about English as a world language with many areas of use.
nb: Hovedområdet dreier seg også om å tilegne kunnskap om engelsk som et verdensspråk med mange bruksområder.

source: ‘How do those who succeed do it?’
nb: – Hvordan gjør de det, de som får det til?

source: The subject shall contribute to knowledge on and respect for various religious, views on life and ethical standpoints in local, national and global perspectives.
nb: Faget skal bidra til kunnskap om og respekt for ulike religiøse, livsynsmessige og etiske ståsteder i lokalt, nasjonalt og globalt perspektiv.

source: It covers polynomial functions, power functions, rational functions, logarithmic functions, exponential functions and combinations of these.
nb: Det omfatter polynomfunksjoner, potensfunksjoner, rasjonale funksjoner, logaritmefunksjoner og eksponentialfunksjoner og sammensetninger av dem.

source: read texts from different genres and with different objectives
nb: lese tekster i ulike sjangere og med ulike formål
